//Вывести квадрат целого числа
Console.WriteLine("Введите число");
int value = int.Parse(Console.ReadLine());
int sum = value*value;
Console.WriteLine("Квадрат числа равен:"+sum);